Revit 2026 API

# LightGroupManagerGetLightDimmer Method

---

Gets the dimmer value for the given light for rendering the given view

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetLightDimmer(
	ElementId viewId,
	ElementId lightId
)
```
```vb
Public Function GetLightDimmer (
	viewId As ElementId,
	lightId As ElementId
) As Double
```
```cpp
public:
double GetLightDimmer(
	ElementId^ viewId,
	ElementId^ lightId
)
```
```fsharp
member GetLightDimmer :
        viewId : ElementId *
        lightId : ElementId -> float
```

#### Parameters

viewId ElementId
     The Id of the view
lightId ElementId
     The Id of the light to turn on or off

#### Return Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | The given element Id does not correspond to a 3d view -or- The given element Id does not correspond to a light instance |
| ArgumentNullException | A non-optional argument was null |

The dimmer value is in the range [0.0, 1.0] with 0.0 being totally dimmed and 1.0 being totally on

#### Reference

LightGroupManager Class

Autodesk.Revit.DB.Lighting Namespace